tutorials/bubbleContactAngle/0.orig/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.1                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField uniform 646;

boundaryField
{
    
    down
    {
        type            fixedValue;
        value           uniform 646;
    }

    FarStream
    {
        type            inletOutlet;
        inletValue      uniform 646;
        value           uniform 646;
    }

    symmetryPlanes
    {
        type            symmetry;
    }
    
    frontAndBack
    {
        type            empty;
    }
    
}


// ************************************************************************* //
