tutorials/bubbleContactAngle/0.orig/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   uniform 10;

boundaryField
{
    
        
    down
    {
        type            zeroGradient;
    }

    FarStream
    {
		type           zeroGradient;
    }


    symmetryPlanes
    {
        type            symmetry;
    }
    
    
    frontAndBack
    {
        type            empty;
    }
    
}


// ************************************************************************* //
