tutorials/bubbleContactAngle/system/blockMeshDict.template
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale 1;

D XM;


vertices
(
    (0 0 0) //0
    (.5 0 0) //1
    (.5 .5 0) //2
    (0 .5 0) //3
    (0 0 .5) //4
    (.5 0 .5)  //5
    (.5 .5 .5) //6
    (0 .5 .5) //7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) ($D $D 1) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    leftWall
    {
        type wall;
        faces
        (
            (0 4 7 3)
        );
    }
    
    rightWall
    {
        type wall;
        faces
        (
            (1 2 6 5)
            
        );
    }
    
    lowerWall
    {
        type wall;
        faces
        (
            (0 1 5 4)

            
        );
    }
    
    atmosphere
    {
        type patch;
        faces
        (
           (2 3 7 6)
            
        );
    }
);

mergePatchPairs
(
);



// ************************************************************************* //
