tutorials/bubbleContactAngle/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     thermalPhaseChangeFoam;

startFrom       startTime;

startTime       0;

stopAt          endTime;

endTime         .004;

deltaT          0.0005;

writeControl    adjustableRunTime;

writeInterval   0.0005;

purgeWrite      0;

writeFormat     binary;

writePrecision  6;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable yes;

adjustTimeStep  yes;

maxCo           1;
maxAlphaCo      1;

maxDeltaT       .005;

functions
{
    isosurfaces
    {
        type            surfaces;
        libs ("libsampling.so");
        writeControl    adjustableRunTime;
        writeInterval   0.0005;
        surfaceFormat   raw;
        fields          ( alpha.water );


        surfaces
        (

          interpolatedIso
          {
              // Iso surface for interpolated values only
              type            isoSurface;      // always triangulated
              isoField        alpha.water;
              isoValue        0.5;
              interpolate     true;
              regularise      false;           // do not simplify
          }

        );
    }
    
    
}




// ************************************************************************* //


// ************************************************************************* //
