tutorials/bubbleContactAngle/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2006                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default Euler;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    div(phi,alpha) /*Gauss PLIC interfaceCompression vanLeer 1*/ Gauss interfaceCompression;
    div(phirb,alpha) Gauss interfaceCompression;
    div(rhoPhi,U)      Gauss limitedLinearV 1;
        div(rhoPhiH,U)  Gauss limitedLinearV 1;

    div(((rho*nuEff)*dev2(T(grad(U))))) Gauss linear;
    div(rhoCpPhi,T) Gauss vanLeer;
    div(phi,T) Gauss linear;

    div((interpolate(cp)*rhoPhi),T) Gauss linear;
}

laplacianSchemes
{
    default        Gauss linear uncorrected;
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         uncorrected;
}

fluxRequired
{
    default         no;
    p_rgh;
    pd;
    pcorr;
    alpha1;
    alpha.water;
}

// ************************************************************************* //
