tutorials/bubbleContactAngle/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


defaultFieldValues
(
    volScalarFieldValue alpha.water 1
    
    
);

regions
(
    cylinderToCell
    {
//         origin (0 0 .5);
        p1 (0 0 -1);
        p2 (0 0 1);
        radius .4;
        fieldValues
        (
            volScalarFieldValue alpha.water 0
            
            
        );
    }
    
//         cylinderToCell
//     {
//         p1 (0 0 2);
//         p2 (0 0 0);
// 
//         radius 1;
//         fieldValues
//         (
//             volScalarFieldValue alpha.water 0
//             
//             
//         );
//     }

);

// ************************************************************************* //
